РазработкаОУМобильная/src/Catalogs/ПодключаемоеОборудование/ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемоеОборудование</name>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУстройства</name>
    <comment>Уникальный идентификатор устройства стандарта оборудования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПакетнаяПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоПечати</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

РазработкаОУМобильная/src/CommonModules/ПодключаемоеОборудование/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОпределитьПодключаемоеОборудование(Драйвер, ПодключаемоеОборудование) Экспорт
	
	ПодключаемоеОборудование = Справочники.ПодключаемоеОборудование.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(Драйвер) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ДрайверОборудования = &ДрайверОборудования";
	
	Запрос.УстановитьПараметр("ДрайверОборудования", Драйвер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПодключаемоеОборудование = Выборка.Ссылка;
		
		Если НЕ ПодключаемоеОборудование.УстройствоИспользуется Тогда
			ПодключаемоеОборудованиеОбъект = ПодключаемоеОборудование.ПолучитьОбъект();
			ПодключаемоеОборудованиеОбъект.УстройствоИспользуется = Истина;
			ПодключаемоеОборудованиеОбъект.Записать();
		КонецЕсли;
		
	Иначе
		
		ПодключаемоеОборудованиеОбъект = Справочники.ПодключаемоеОборудование.СоздатьЭлемент();
		
		ПодключаемоеОборудованиеОбъект.ТипОборудования        = Драйвер.ТипОборудования;
		ПодключаемоеОборудованиеОбъект.ДрайверОборудования    = Драйвер;
		ПодключаемоеОборудованиеОбъект.Наименование           = Драйвер.Наименование;
		ПодключаемоеОборудованиеОбъект.УстройствоИспользуется = Истина;
		ПодключаемоеОборудованиеОбъект.Записать();
		
		ПодключаемоеОборудование = ПодключаемоеОборудованиеОбъект.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
